---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallAlignmentMethod
source: html/98926f08-1844-232d-d907-591fff600411.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelWallAlignmentMethod Property

"Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelWallAlignmentMethod { get; }
```